RoodsBurger/brushless_lamp/s3/archive/milestones/m2-knob/sdkconfig.defaults.esp32s3
CONFIG_IDF_TARGET="esp32s3"

## USB-C console via USB_SERIAL_JTAG (printf + arduino Serial both route here).
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y

## PSRAM disabled — XIAO S3 uses ESP32-S3R8 with Octal PSRAM that doesn't boot
## with QUAD. M2 has no need for extra RAM anyway (no Matter, no WiFi).
# CONFIG_SPIRAM is not set

## No BT, no WiFi — motor + knob only.
CONFIG_BT_ENABLED=n
